porrey/Mioduino/boards.txt
mioduino.name=Mioduino

mioduino.upload.tool=avrdude
mioduino.upload.protocol=arduino
mioduino.upload.maximum_size=30720
mioduino.upload.maximum_data_size=2048
mioduino.upload.maximum_eeprom_size=1024
mioduino.upload.speed=57600

mioduino.bootloader.tool=arduino:avrdude
mioduino.bootloader.low_fuses=0xFF
mioduino.bootloader.high_fuses=0xDA
mioduino.bootloader.extended_fuses=0x05
mioduino.bootloader.unlock_bits=0x3F
mioduino.bootloader.lock_bits=0x0F
mioduino.bootloader.file=Adaboot328/ATmegaBOOT_xx8_adaboot328.hex

mioduino.build.mcu=atmega328p
mioduino.build.f_cpu=16000000L
mioduino.build.board=AVR_MIODUINO
mioduino.build.core=arduino:arduino
mioduino.build.variant=mioduino
